# 1. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Use comprehension.
# in
# 9
#
# out
# [15, 16, 2, 3, 1, 7, 5, 4, 10]
# [16, 3, 7, 10]
#
# in
# 10
#
# out
# [28, 20, 10, 5, 1, 24, 7, 15, 23, 25]
# [24, 15, 23, 25]
# _______________________________________________________________________________________________________________________
import random
items = [random.randint(0, 101) for i in range(5)]
print(items)

m = [j for i, j in zip(items, items[1:]) if j > i]
print(m)
